InformationRegisters/РазмерыВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РазмерыВычетовИПН</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПределаВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПределовВычетовИКорректировокДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидВычетаИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПредоставленияВычетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПредоставленияВычетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИсчисленнойСуммеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандартный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПериодическимПлатежам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РазмерыВычетовИПН/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20190101') Тогда
			
			ВызватьИсключение НСтр("ru = 'Данные в регистр сведений о размере предела вычета ИПН вводятся не ранее 2019 года (до 2019 используется реквизит справочника ""Виды вычетов ИПН"")'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидВычетаИПН.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
			
			ВызватьИсключение НСтр("ru = 'Невозможно ввести данные о размере вычета для периода предоставления ""По исчисленной сумме взносов""'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидВычетаИПН = Справочники.ВычетыИПН.ВычетОПВ
			ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВычетыИПН.ДобровольныеПенсионныеВзносы
			ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВычетыИПН.ПогашениеВознагражденияПоЖилищнымЗаймам Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Невозможно ввести данные о размере для вычетов ""%1"", ""%2"", ""%3""'"), 
																						Справочники.ВычетыИПН.ВычетОПВ, 
																						Справочники.ВычетыИПН.ДобровольныеПенсионныеВзносы, 
																						Справочники.ВычетыИПН.ПогашениеВознагражденияПоЖилищнымЗаймам);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
